Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
/**
 ******************************************************************************
 * @file    bl70x_usb.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_usb.h"
#include "bl702_common.h"
#include "bl702_glb.h"

/** @addtogroup  BL70X_Peripheral_Driver
 *  @{
 */

/** @addtogroup  USB
 *  @{
 */

/** @defgroup  USB_Private_Macros
 *  @{
 */

/*@} end of group USB_Private_Macros */

/** @defgroup  USB_Private_Types
 *  @{
 */

/*@} end of group USB_Private_Types */

/** @defgroup  USB_Private_Variables
 *  @{
 */

/*@} end of group USB_Private_Variables */

/** @defgroup  USB_Global_Variables
 *  @{
 */

/*@} end of group USB_Global_Variables */

/** @defgroup  USB_Private_Fun_Declaration
 *  @{
 */

/*@} end of group USB_Private_Fun_Declaration */

/** @defgroup  USB_Private_Functions
 *  @{
 */

/*@} end of group USB_Private_Functions */

/** @defgroup  USB_Public_Functions
 *  @{
 */

BL_Err_Type USB_Enable(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EN);
  BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_Disable(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_USB_EN);
  BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_Set_Config(BL_Fun_Type enable, USB_Config_Type *usbCfg) {
  uint32_t tmpVal = 0;

  /* disable USB first */
  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_USB_EN);
  BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);

  /* USB config */
  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);

  if (usbCfg->SoftwareCtrl == ENABLE) {
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_ADDR, usbCfg->DeviceAddress);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_SIZE, usbCfg->EnumMaxPacketSize);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_NACK_IN, usbCfg->EnumInEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_NACK_OUT, usbCfg->EnumOutEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_ROM_DCT_EN, usbCfg->RomBaseDescriptorUsed);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_ROM_DCT_EN, usbCfg->RomBaseDescriptorUsed);
  }

  BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);

  /* enable/disable USB */
  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);

  if (enable) {
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EN);
  }

  BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_Set_Device_Addr(uint8_t addr) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_ADDR, addr);
  BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);

  return SUCCESS;
}

uint8_t USB_Get_Device_Addr(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);

  return BL_GET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_ADDR);
}

BL_Err_Type USB_Set_EPx_Xfer_Size(USB_EP_ID epId, uint8_t size) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_SIZE, size);
    BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);
  } else {
    switch (epId) {
    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP4_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP5_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP6_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP7_SIZE, size);
      BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Err_Type USB_Set_EPx_IN_Busy(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

