Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
  if (epId == EP_ID0) {
    tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_NACK_OUT);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_NACK_IN);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_STALL);
    BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);
  } else {
    switch (epId) {
    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP1_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_STALL);
      BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP2_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_STALL);
      BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP3_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_STALL);
      BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP4_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_STALL);
      BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP5_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_STALL);
      BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP6_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_STALL);
      BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP7_NACK);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_STALL);
      BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Err_Type USB_Set_EPx_Rdy(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_RDY);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_NACK_OUT);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_NACK_IN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_USB_EP0_SW_STALL);
    BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);
  } else {
    switch (epId) {
    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP1_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP1_STALL);
      BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP2_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP2_STALL);
      BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP3_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP3_STALL);
      BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP4_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP4_STALL);
      BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP5_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP5_STALL);
      BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP6_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP6_STALL);
      BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_RDY);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_EP7_NACK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_EP7_STALL);
      BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Sts_Type USB_Is_EPx_RDY_Free(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_USB_EP0_SW_RDY);
  } else {
    switch (epId) {
    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP1_RDY);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP2_RDY);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP3_RDY);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP4_RDY);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP5_RDY);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP6_RDY);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP7_RDY);
      break;

    default:
      break;
    }
  }

  return tmpVal ? RESET : SET;
}

