Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
  if (epId == EP_ID0) {
    tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);

    switch ((tmpVal >> 24) & 0x7) {
    case 0:
      return USB_EP_STATUS_ACK;

    case 1:
      return USB_EP_STATUS_STALL;

    case 2:
    case 4:
    case 6:
      return USB_EP_STATUS_NACK;

    default:
      break;
    }
  } else {
    switch (epId) {
    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
      break;

    default:
      tmpVal = 0;
      break;
    }

    switch ((tmpVal >> 14) & 0x3) {
    case 0:
      return USB_EP_STATUS_ACK;

    case 1:
      return USB_EP_STATUS_STALL;

    case 2:
      return USB_EP_STATUS_NACK;

    case 3:
    default:
      break;
    }
  }

  return USB_EP_STATUS_NSTALL;
}

BL_Err_Type USB_IntEn(USB_INT_Type intType, uint8_t enable) {
  uint32_t tmpVal = 0;

  if (USB_INT_ALL == intType) {
    if (enable) {
      BL_WR_REG(USB_BASE, USB_INT_EN, USB_INT_TYPE_ALL);
    } else {
      BL_WR_REG(USB_BASE, USB_INT_EN, ~USB_INT_TYPE_ALL);
    }

    return SUCCESS;
  }

  tmpVal = BL_RD_REG(USB_BASE, USB_INT_EN);

  if (enable) {
    tmpVal |= (1 << intType);
  } else {
    tmpVal &= ~(1 << intType);
  }

  BL_WR_REG(USB_BASE, USB_INT_EN, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_IntMask(USB_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal = 0;

  if (USB_INT_ALL == intType) {
    if (intMask != UNMASK) {
      BL_WR_REG(USB_BASE, USB_INT_MASK, USB_INT_TYPE_ALL);
    } else {
      BL_WR_REG(USB_BASE, USB_INT_MASK, ~USB_INT_TYPE_ALL);
    }

    return SUCCESS;
  }

  tmpVal = BL_RD_REG(USB_BASE, USB_INT_MASK);

  if (intMask != UNMASK) {
    tmpVal |= (1 << intType);
  } else {
    tmpVal &= ~(1 << intType);
  }

  BL_WR_REG(USB_BASE, USB_INT_MASK, tmpVal);

  return SUCCESS;
}

BL_Sts_Type USB_Get_IntStatus(USB_INT_Type intType) {
  if (USB_INT_ALL == intType) {
    return BL_RD_REG(USB_BASE, USB_INT_STS) ? SET : RESET;
  }

  return ((BL_RD_REG(USB_BASE, USB_INT_STS) & (1 << intType))) ? SET : RESET;
}

BL_Err_Type USB_Clr_IntStatus(USB_INT_Type intType) {
  uint32_t tmpVal = 0;

  if (USB_INT_ALL == intType) {
    BL_WR_REG(USB_BASE, USB_INT_CLEAR, USB_INT_TYPE_ALL);

    return SUCCESS;
  }

  tmpVal = BL_RD_REG(USB_BASE, USB_INT_CLEAR);
  tmpVal |= (1 << intType);
  BL_WR_REG(USB_BASE, USB_INT_CLEAR, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_Clr_EPx_IntStatus(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_INT_CLEAR);

  if (epId == EP_ID0) {
    tmpVal |= (0x3F << 4);
  } else {
    tmpVal |= (0x3 << (epId * 2 + 8));
  }

  BL_WR_REG(USB_BASE, USB_INT_CLEAR, tmpVal);

  return SUCCESS;
}

uint16_t USB_Get_Frame_Num(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_FRAME_NO);

  return tmpVal & 0x7ff;
}

BL_Err_Type USB_Set_EPx_Config(USB_EP_ID epId, EP_Config_Type *epCfg) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    return ERROR;
  }

  switch (epId) {
  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP4_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP4_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP4_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP5_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP5_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP5_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP6_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP6_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP6_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP7_TYPE, epCfg->type);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP7_DIR, epCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP7_SIZE, epCfg->EPMaxPacketSize);
    BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
    break;

  default:
    break;
  }

  return SUCCESS;
}

