Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
BL_Err_Type USB_Set_EPx_Type(USB_EP_ID epId, EP_XFER_Type type) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    return ERROR;
  }

  switch (epId) {
  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP4_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP5_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP6_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP7_TYPE, type);
    BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
    break;

  default:
    break;
  }

  return SUCCESS;
}

EP_XFER_Type USB_Get_EPx_Type(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    return EP_CTRL;
  }

  switch (epId) {
  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP1_TYPE);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP2_TYPE);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP3_TYPE);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP4_TYPE);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP5_TYPE);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP6_TYPE);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP7_TYPE);
    break;

  default:
    break;
  }

  return (EP_XFER_Type)tmpVal;
}

BL_Err_Type USB_Set_EPx_Dir(USB_EP_ID epId, EP_XFER_DIR dir) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    return ERROR;
  }

  switch (epId) {
  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP4_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP4_CONFIG, tmpVal);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP5_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP5_CONFIG, tmpVal);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP6_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP6_CONFIG, tmpVal);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP7_DIR, dir);
    BL_WR_REG(USB_BASE, USB_EP7_CONFIG, tmpVal);
    break;

  default:
    break;
  }

  return SUCCESS;
}

EP_XFER_DIR USB_Get_EPx_Dir(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  if (epId == EP_ID0) {
    return EP_DISABLED;
  }

  switch (epId) {
  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP1_DIR);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP2_DIR);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP3_DIR);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP4_DIR);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP5_DIR);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP6_DIR);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_CR_EP7_DIR);
    break;

  default:
    break;
  }

  return (EP_XFER_DIR)tmpVal;
}

BL_Err_Type USB_Set_EPx_Size(USB_EP_ID epId, uint32_t size) {
  uint32_t tmpVal = 0;

  switch (epId) {
  case EP_ID0:
    tmpVal = BL_RD_REG(USB_BASE, USB_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_USB_EP0_SW_SIZE, size);
    BL_WR_REG(USB_BASE, USB_CONFIG, tmpVal);
    break;

  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP1_SIZE, size);
    BL_WR_REG(USB_BASE, USB_EP1_CONFIG, tmpVal);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP2_SIZE, size);
    BL_WR_REG(USB_BASE, USB_EP2_CONFIG, tmpVal);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_EP3_SIZE, size);
    BL_WR_REG(USB_BASE, USB_EP3_CONFIG, tmpVal);
    break;

