Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_RX_FIFO_UNDERFLOW);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_RX_FIFO_UNDERFLOW);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_RX_FIFO_UNDERFLOW);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_RX_FIFO_UNDERFLOW);
      break;

    default:
      tmpVal = 0;
      break;
    }
  }

  return tmpVal ? SET : RESET;
}

BL_Err_Type USB_Clr_EPx_TX_FIFO_Errors(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  switch (epId) {
  case EP_ID0:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP0_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP0_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP1_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP1_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP2_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP2_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP3_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP3_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP4_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP4_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP5_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP5_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP6_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP6_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP7_TX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP7_FIFO_CONFIG, tmpVal);
    break;

  default:
    break;
  }

  return SUCCESS;
}

BL_Err_Type USB_Clr_EPx_RX_FIFO_Errors(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  switch (epId) {
  case EP_ID0:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP0_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP0_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP1_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP1_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP2_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP2_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP3_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP3_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP4_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP4_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP5_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP5_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP6_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP6_FIFO_CONFIG, tmpVal);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP7_RX_FIFO_CLR);
    BL_WR_REG(USB_BASE, USB_EP7_FIFO_CONFIG, tmpVal);
    break;

  default:
    break;
  }

  return SUCCESS;
}

BL_Err_Type USB_EPx_Write_Data_To_FIFO(USB_EP_ID epId, uint8_t *pData, uint16_t len) {
  uint32_t timeout = 0x00FFFFFF;

  while ((!USB_Is_EPx_RDY_Free(epId)) && timeout) {
    timeout--;
  }

  if (!timeout) {
    return ERROR;
  }

  if (len == 1) {
    USB_Set_EPx_Xfer_Size(EP_ID0, 1);
  } else {
    USB_Set_EPx_Xfer_Size(EP_ID0, 64);
  }

  for (uint16_t i = 0; i < len; i++) {
    switch (epId) {
    case EP_ID0:
      BL_WR_REG(USB_BASE, USB_EP0_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID1:
      BL_WR_REG(USB_BASE, USB_EP1_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID2:
      BL_WR_REG(USB_BASE, USB_EP2_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID3:
      BL_WR_REG(USB_BASE, USB_EP3_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID4:
      BL_WR_REG(USB_BASE, USB_EP4_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID5:
      BL_WR_REG(USB_BASE, USB_EP5_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID6:
      BL_WR_REG(USB_BASE, USB_EP6_TX_FIFO_WDATA, pData[i]);
      break;

    case EP_ID7:
      BL_WR_REG(USB_BASE, USB_EP7_TX_FIFO_WDATA, pData[i]);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Err_Type USB_EPx_Read_Data_From_FIFO(USB_EP_ID epId, uint8_t *pBuff, uint16_t len) {
  for (uint16_t i = 0; i < len; i++) {
    switch (epId) {
    case EP_ID0:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP0_RX_FIFO_RDATA);
      break;

    case EP_ID1:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP1_RX_FIFO_RDATA);
      break;

    case EP_ID2:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP2_RX_FIFO_RDATA);
      break;

    case EP_ID3:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP3_RX_FIFO_RDATA);
      break;

