Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
    case EP_ID4:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP4_RX_FIFO_RDATA);
      break;

    case EP_ID5:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP5_RX_FIFO_RDATA);
      break;

    case EP_ID6:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP6_RX_FIFO_RDATA);
      break;

    case EP_ID7:
      pBuff[i] = (uint8_t)BL_RD_REG(USB_BASE, USB_EP7_RX_FIFO_RDATA);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Err_Type USB_Set_EPx_TX_DMA_Interface_Config(USB_EP_ID epId, BL_Fun_Type newState) {
  uint32_t tmpVal = 0;

  if (newState == ENABLE) {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP0_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP0_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP1_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP1_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP2_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP2_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP3_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP3_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP4_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP4_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP5_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP5_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP6_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP6_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP7_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP7_FIFO_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  } else {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP0_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP0_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP1_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP1_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP2_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP2_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP3_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP3_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP4_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP4_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP5_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP5_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP6_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP6_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP7_DMA_TX_EN);
      BL_WR_REG(USB_BASE, USB_EP7_FIFO_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Err_Type USB_Set_EPx_RX_DMA_Interface_Config(USB_EP_ID epId, BL_Fun_Type newState) {
  uint32_t tmpVal = 0;

  if (newState == ENABLE) {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP0_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP0_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP1_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP1_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP2_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP2_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP3_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP3_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP4_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP4_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP5_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP5_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP6_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP6_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, USB_EP7_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP7_FIFO_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  } else {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP0_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP0_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP1_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP1_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP2_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP2_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP3_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP3_FIFO_CONFIG, tmpVal);
      break;

