Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP4_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP4_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP5_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP5_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP6_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP6_FIFO_CONFIG, tmpVal);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, USB_EP7_DMA_RX_EN);
      BL_WR_REG(USB_BASE, USB_EP7_FIFO_CONFIG, tmpVal);
      break;

    default:
      break;
    }
  }

  return SUCCESS;
}

BL_Err_Type USB_EPx_Write_Data_To_FIFO_DMA(USB_EP_ID epId, uint8_t *pData, uint16_t len) {
  /* not yet implemented */

  return SUCCESS;
}

BL_Err_Type USB_EPx_Read_Data_From_FIFO_DMA(USB_EP_ID epId, uint8_t *pBuff, uint16_t len) {
  /* not yet implemented */

  return SUCCESS;
}

uint16_t USB_Get_EPx_TX_FIFO_CNT(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  switch (epId) {
  case EP_ID0:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP0_TX_FIFO_CNT);
    break;

  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP1_TX_FIFO_CNT);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP2_TX_FIFO_CNT);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP3_TX_FIFO_CNT);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_TX_FIFO_CNT);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_TX_FIFO_CNT);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_TX_FIFO_CNT);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_TX_FIFO_CNT);
    break;

  default:
    tmpVal = 0;
    break;
  }

  return tmpVal;
}

uint16_t USB_Get_EPx_RX_FIFO_CNT(USB_EP_ID epId) {
  uint32_t tmpVal = 0;

  switch (epId) {
  case EP_ID0:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP0_RX_FIFO_CNT);
    break;

  case EP_ID1:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP1_RX_FIFO_CNT);
    break;

  case EP_ID2:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP2_RX_FIFO_CNT);
    break;

  case EP_ID3:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP3_RX_FIFO_CNT);
    break;

  case EP_ID4:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_RX_FIFO_CNT);
    break;

  case EP_ID5:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_RX_FIFO_CNT);
    break;

  case EP_ID6:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_RX_FIFO_CNT);
    break;

  case EP_ID7:
    tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_RX_FIFO_CNT);
    break;

  default:
    tmpVal = 0;
    break;
  }

  return tmpVal;
}

BL_Sts_Type USB_Get_EPx_TX_FIFO_Status(USB_EP_ID epId, USB_FIFO_STATUS_Type sts) {
  uint32_t tmpVal = 0;

  if (sts == USB_FIFO_EMPTY) {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP0_TX_FIFO_EMPTY);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP1_TX_FIFO_EMPTY);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP2_TX_FIFO_EMPTY);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP3_TX_FIFO_EMPTY);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_TX_FIFO_EMPTY);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_TX_FIFO_EMPTY);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_TX_FIFO_EMPTY);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_TX_FIFO_EMPTY);
      break;

    default:
      tmpVal = 0;
      break;
    }
  } else {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP0_TX_FIFO_FULL);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP1_TX_FIFO_FULL);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP2_TX_FIFO_FULL);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP3_TX_FIFO_FULL);
      break;

