Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_usb.c
    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_TX_FIFO_FULL);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_TX_FIFO_FULL);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_TX_FIFO_FULL);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_TX_FIFO_FULL);
      break;

    default:
      tmpVal = 0;
      break;
    }
  }

  return tmpVal ? SET : RESET;
}

BL_Sts_Type USB_Get_EPx_RX_FIFO_Status(USB_EP_ID epId, USB_FIFO_STATUS_Type sts) {
  uint32_t tmpVal = 0;

  if (sts == USB_FIFO_EMPTY) {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP0_RX_FIFO_EMPTY);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP1_RX_FIFO_EMPTY);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP2_RX_FIFO_EMPTY);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP3_RX_FIFO_EMPTY);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_RX_FIFO_EMPTY);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_RX_FIFO_EMPTY);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_RX_FIFO_EMPTY);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_RX_FIFO_EMPTY);
      break;

    default:
      tmpVal = 0;
      break;
    }
  } else {
    switch (epId) {
    case EP_ID0:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP0_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP0_RX_FIFO_FULL);
      break;

    case EP_ID1:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP1_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP1_RX_FIFO_FULL);
      break;

    case EP_ID2:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP2_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP2_RX_FIFO_FULL);
      break;

    case EP_ID3:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP3_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP3_RX_FIFO_FULL);
      break;

    case EP_ID4:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP4_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP4_RX_FIFO_FULL);
      break;

    case EP_ID5:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP5_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP5_RX_FIFO_FULL);
      break;

    case EP_ID6:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP6_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP6_RX_FIFO_FULL);
      break;

    case EP_ID7:
      tmpVal = BL_RD_REG(USB_BASE, USB_EP7_FIFO_STATUS);
      tmpVal = BL_GET_REG_BITS_VAL(tmpVal, USB_EP7_RX_FIFO_FULL);
      break;

    default:
      tmpVal = 0;
      break;
    }
  }

  return tmpVal ? SET : RESET;
}

BL_Err_Type USB_Set_Internal_PullUp_Config(BL_Fun_Type newState) {
  uint32_t tmpVal = 0;

  /* recommended: fclk<=160MHz, bclk<=80MHz */
  tmpVal = BL_RD_REG(GLB_BASE, GLB_USB_XCVR);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_USB_ENUM, newState);
  BL_WR_REG(GLB_BASE, GLB_USB_XCVR, tmpVal);

  return SUCCESS;
}

BL_Sts_Type USB_Get_LPM_Status(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CONFIG);

  return BL_GET_REG_BITS_VAL(tmpVal, USB_STS_LPM) ? SET : RESET;
}

uint16_t USB_Get_LPM_Packet_Attr(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CONFIG);

  return BL_GET_REG_BITS_VAL(tmpVal, USB_STS_LPM_ATTR);
}

BL_Err_Type USB_Set_LPM_Default_Response(USB_LPM_DEFAULT_RESP_Type defaultResp) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_LPM_RESP, defaultResp);
  BL_WR_REG(USB_BASE, USB_LPM_CONFIG, tmpVal);

  tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_LPM_RESP_UPD);
  BL_WR_REG(USB_BASE, USB_LPM_CONFIG, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_LPM_Enable(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_LPM_EN);
  BL_WR_REG(USB_BASE, USB_LPM_CONFIG, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_LPM_Disable(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CR_LPM_EN);
  BL_WR_REG(USB_BASE, USB_LPM_CONFIG, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_Device_Output_K_State(uint16_t stateWidth) {
  uint32_t tmpVal = 0;

  CHECK_PARAM((stateWidth <= 0x7FF));

  tmpVal = BL_RD_REG(USB_BASE, USB_RESUME_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_CR_RES_WIDTH, stateWidth);
  BL_WR_REG(USB_BASE, USB_RESUME_CONFIG, tmpVal);

  tmpVal = BL_RD_REG(USB_BASE, USB_RESUME_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, USB_CR_RES_TRIG);
  BL_WR_REG(USB_BASE, USB_RESUME_CONFIG, tmpVal);

  return SUCCESS;
}

uint8_t USB_Get_Current_Packet_PID(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_FRAME_NO);

  return BL_GET_REG_BITS_VAL(tmpVal, USB_STS_PID);
}

uint8_t USB_Get_Current_Packet_EP(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_FRAME_NO);

  return BL_GET_REG_BITS_VAL(tmpVal, USB_STS_EP_NO);
}

BL_Sts_Type USB_Get_Error_Status(USB_ERROR_Type err) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_ERROR);

  return tmpVal & (1 << err) ? SET : RESET;
}

BL_Err_Type USB_Clr_Error_Status(USB_ERROR_Type err) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_INT_CLEAR);
  tmpVal |= (1 << USB_INT_ERROR);
  BL_WR_REG(USB_BASE, USB_INT_CLEAR, tmpVal);

  return SUCCESS;
}

BL_Err_Type USB_Clr_RstEndIntStatus(void) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(USB_BASE, USB_INT_CLEAR);
  tmpVal |= (1 << 27);
  BL_WR_REG(USB_BASE, USB_INT_CLEAR, tmpVal);

  return SUCCESS;
}

/*@} end of group USB_Public_Functions */

/*@} end of group USB */

/*@} end of group BL70X_Peripheral_Driver */
